{"primaryContentSections":[{"kind":"content","content":[{"anchor":"Overview","level":2,"type":"heading","text":"Overview"},{"type":"paragraph","inlineContent":[{"type":"text","text":"AXComponentKit is a thin, lightweight framework that simplifies the setup and execution of UI automation tests. It was inspired by the desire to reduce complexity of UI testing code through patterns that feel more natural in Swift and do not involve heavily abstracting XCTest. Special emphasis was given to propagating more informative failure diagnostics than typically provided by traditional XCTest abstractions."}]},{"anchor":"Identity","level":4,"type":"heading","text":"Identity"},{"type":"paragraph","inlineContent":[{"type":"text","text":"AXComponentKit follows a Page Object Model (POM) structure, but since iOS doesn’t have “pages,” refers to them as "},{"type":"strong","inlineContent":[{"type":"text","text":"screen models"}]},{"type":"text","text":". These models are shared between both the app and test targets to create a single source of truth.  They store "},{"type":"strong","inlineContent":[{"type":"text","text":"components"}]},{"type":"text","text":", which function as automation identifiers and can be either static or dynamically computed based on their context within a screen."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"Screen models opt-in to capabilities via protocol composition, allowing their functionality to be precisely defined. For example, a screen model may opt into a protocol that gives it access to a shared tab bar element, or navigation bars. This compositional approach is in contrast to POM architectures that rely on inheritance to propagate elements and behaviors such that parent classes often pass down capabilities that individual screens may or may not have."}]},{"anchor":"Navigation","level":4,"type":"heading","text":"Navigation"},{"type":"paragraph","inlineContent":[{"type":"text","text":"XCTest does not provide much in the way of scaffolding for navigating complex view hierarchies. This can lead to complex, hard to read, and sometimes unreliable abstractions being hastily written to help with different test cases as needs arise. AXComponentKit attempts to solve this problem by providing scaffolding to make navigation easier to reason about, and much more stable."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"Each screen model has an associated "},{"type":"strong","inlineContent":[{"type":"text","text":"Navigator"}]},{"type":"text","text":", which breaks up navigation into discrete operations driven by actions on the UI. A successful operation returns a navigator for its destination screen, making operations "},{"type":"emphasis","inlineContent":[{"type":"text","text":"composable"}]},{"type":"text","text":" into a chain.  This means operations can be used and reused within chains to traverse multiple screens."}]},{"anchor":"Safety","level":4,"type":"heading","text":"Safety"},{"type":"paragraph","inlineContent":[{"type":"text","text":"Historically, a common source of flaky UI automation tests is attempting to interact with elements that are not yet visible. This can be due to sluggish animated transitions in a continuous integration pipeline, or even due to simulator size variations. One of AXComponentKit’s primary goals is to significantly reduce flakiness by providing guarantees about XCUIElement readiness for interaction."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"Structured concurrency provides a natural means of accessing UI elements asynchronously in UI tests. Fetching an element inherently ensures its existence, unless the test author explicitly fetches it without the guarantee. This notion is carried forward to ensure the existence of entire screens during navigation, which provides a new failure diagnostic that is much easier to understand. If an element is queried and does not come into existence within a timeout period, an error is thrown and the test fails with another informative diagnostic."}]}]}],"schemaVersion":{"major":0,"minor":3,"patch":0},"sections":[],"variants":[{"paths":["\/documentation\/axcomponentkit\/philosophy"],"traits":[{"interfaceLanguage":"swift"}]}],"identifier":{"url":"doc:\/\/AXComponentKit\/documentation\/AXComponentKit\/Philosophy","interfaceLanguage":"swift"},"abstract":[{"type":"text","text":"The design considerations behind AXComponentKit"}],"kind":"article","metadata":{"roleHeading":"Article","title":"Philosophy","role":"article","modules":[{"name":"AXComponentKit"}]},"hierarchy":{"paths":[["doc:\/\/AXComponentKit\/documentation\/AXComponentKit"]]},"seeAlsoSections":[{"title":"Essentials","identifiers":["doc:\/\/AXComponentKit\/documentation\/AXComponentKit\/GettingStarted"],"generated":true}],"references":{"doc://AXComponentKit/documentation/AXComponentKit":{"role":"collection","title":"AXComponentKit","abstract":[{"type":"text","text":"Modular UI testing framework abstraction that works in concert with XCTest"}],"identifier":"doc:\/\/AXComponentKit\/documentation\/AXComponentKit","kind":"symbol","type":"topic","url":"\/documentation\/axcomponentkit"},"doc://AXComponentKit/documentation/AXComponentKit/GettingStarted":{"role":"article","title":"Getting Started with AXComponentKit","abstract":[{"type":"text","text":"There are basic things you need to know"}],"identifier":"doc:\/\/AXComponentKit\/documentation\/AXComponentKit\/GettingStarted","kind":"article","type":"topic","url":"\/documentation\/axcomponentkit\/gettingstarted"}}}